CSI API ETABS v1
cDetailing.GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneVerticalBarInfo Method
 Defines one set of Vertical bars, along local X axis of the Design Leg. Each data set represents one group of bars, placed along a line, with refrence to Design Leg centerline
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneVerticalBarInfo(
	int WallStackIndex,
	int PierIndex,
	int DesignLegIndex,
	int VerticalBarIndex,
	ref string GUID,
	ref double BarSizeFirst_Dia,
	ref double BarSizeFirst_Area,
	ref double BarSizeFirst_Fy,
	ref string BarSizeFirst_Notation,
	ref double BarSizeLast_Dia,
	ref double BarSizeLast_Area,
	ref double BarSizeLast_Fy,
	ref string BarSizeLast_Notation,
	ref double BarSizeOthers_Dia,
	ref double BarSizeOthers_Area,
	ref double BarSizeOthers_Fy,
	ref string BarSizeOthers_Notation,
	ref int Number,
	ref double StartX,
	ref double StartY,
	ref double EndX,
	ref double EndY,
	ref int StartBarBend,
	ref int EndBarBend,
	ref double OffsetZ,
	ref double BarLength,
	ref int LocationCode
)
Function GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneVerticalBarInfo (
	WallStackIndex As Integer,
	PierIndex As Integer,
	DesignLegIndex As Integer,
	VerticalBarIndex As Integer,
	ByRef GUID As String,
	ByRef BarSizeFirst_Dia As Double,
	ByRef BarSizeFirst_Area As Double,
	ByRef BarSizeFirst_Fy As Double,
	ByRef BarSizeFirst_Notation As String,
	ByRef BarSizeLast_Dia As Double,
	ByRef BarSizeLast_Area As Double,
	ByRef BarSizeLast_Fy As Double,
	ByRef BarSizeLast_Notation As String,
	ByRef BarSizeOthers_Dia As Double,
	ByRef BarSizeOthers_Area As Double,
	ByRef BarSizeOthers_Fy As Double,
	ByRef BarSizeOthers_Notation As String,
	ByRef Number As Integer,
	ByRef StartX As Double,
	ByRef StartY As Double,
	ByRef EndX As Double,
	ByRef EndY As Double,
	ByRef StartBarBend As Integer,
	ByRef EndBarBend As Integer,
	ByRef OffsetZ As Double,
	ByRef BarLength As Double,
	ByRef LocationCode As Integer
) As Integer
Dim instance As cDetailing
Dim WallStackIndex As Integer
Dim PierIndex As Integer
Dim DesignLegIndex As Integer
Dim VerticalBarIndex As Integer
Dim GUID As String
Dim BarSizeFirst_Dia As Double
Dim BarSizeFirst_Area As Double
Dim BarSizeFirst_Fy As Double
Dim BarSizeFirst_Notation As String
Dim BarSizeLast_Dia As Double
Dim BarSizeLast_Area As Double
Dim BarSizeLast_Fy As Double
Dim BarSizeLast_Notation As String
Dim BarSizeOthers_Dia As Double
Dim BarSizeOthers_Area As Double
Dim BarSizeOthers_Fy As Double
Dim BarSizeOthers_Notation As String
Dim Number As Integer
Dim StartX As Double
Dim StartY As Double
Dim EndX As Double
Dim EndY As Double
Dim StartBarBend As Integer
Dim EndBarBend As Integer
Dim OffsetZ As Double
Dim BarLength As Double
Dim LocationCode As Integer
Dim returnValue As Integer
returnValue = instance.GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneVerticalBarInfo(WallStackIndex,
	PierIndex, DesignLegIndex, VerticalBarIndex,
	GUID, BarSizeFirst_Dia, BarSizeFirst_Area,
	BarSizeFirst_Fy, BarSizeFirst_Notation,
	BarSizeLast_Dia, BarSizeLast_Area,
	BarSizeLast_Fy, BarSizeLast_Notation,
	BarSizeOthers_Dia, BarSizeOthers_Area,
	BarSizeOthers_Fy, BarSizeOthers_Notation,
	Number, StartX, StartY, EndX, EndY,
	StartBarBend, EndBarBend, OffsetZ,
	BarLength, LocationCode)
int GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneVerticalBarInfo(
	int WallStackIndex,
	int PierIndex,
	int DesignLegIndex,
	int VerticalBarIndex,
	String^% GUID,
	double% BarSizeFirst_Dia,
	double% BarSizeFirst_Area,
	double% BarSizeFirst_Fy,
	String^% BarSizeFirst_Notation,
	double% BarSizeLast_Dia,
	double% BarSizeLast_Area,
	double% BarSizeLast_Fy,
	String^% BarSizeLast_Notation,
	double% BarSizeOthers_Dia,
	double% BarSizeOthers_Area,
	double% BarSizeOthers_Fy,
	String^% BarSizeOthers_Notation,
	int% Number,
	double% StartX,
	double% StartY,
	double% EndX,
	double% EndY,
	int% StartBarBend,
	int% EndBarBend,
	double% OffsetZ,
	double% BarLength,
	int% LocationCode
)
abstract GetDetailedWall_OneWallStack_OnePier_OneDesignLeg_OneVerticalBarInfo :
        WallStackIndex : int *
        PierIndex : int *
        DesignLegIndex : int *
        VerticalBarIndex : int *
        GUID : string byref *
        BarSizeFirst_Dia : float byref *
        BarSizeFirst_Area : float byref *
        BarSizeFirst_Fy : float byref *
        BarSizeFirst_Notation : string byref *
        BarSizeLast_Dia : float byref *
        BarSizeLast_Area : float byref *
        BarSizeLast_Fy : float byref *
        BarSizeLast_Notation : string byref *
        BarSizeOthers_Dia : float byref *
        BarSizeOthers_Area : float byref *
        BarSizeOthers_Fy : float byref *
        BarSizeOthers_Notation : string byref *
        Number : int byref *
        StartX : float byref *
        StartY : float byref *
        EndX : float byref *
        EndY : float byref *
        StartBarBend : int byref *
        EndBarBend : int byref *
        OffsetZ : float byref *
        BarLength : float byref *
        LocationCode : int byref -> int
Parameters
WallStackIndex
Type: System.Int32
 Wall Stack Index
PierIndex
Type: System.Int32
 Pier Output Index
DesignLegIndex
Type: System.Int32
 Design leg Index
VerticalBarIndex
Type: System.Int32
 Vertical Index
GUID
Type: System.String
 GUID
BarSizeFirst_Dia
Type: System.Double
 Information about the first bar in bar group Dia
BarSizeFirst_Area
Type: System.Double
 Information about the first bar in bar group Area
BarSizeFirst_Fy
Type: System.Double
 Information about the first bar in bar group Fy
BarSizeFirst_Notation
Type: System.String
 Information about the first bar in bar group notation
BarSizeLast_Dia
Type: System.Double
 Information about the last bar in bar group Dia
BarSizeLast_Area
Type: System.Double
 Information about the last bar in bar group Area
BarSizeLast_Fy
Type: System.Double
 Information about the last bar in bar group Fy
BarSizeLast_Notation
Type: System.String
 Information about the last bar in bar group notation
BarSizeOthers_Dia
Type: System.Double
 Information about the other bar in bar group Dia
BarSizeOthers_Area
Type: System.Double
 Information about the other bar in bar group Area
BarSizeOthers_Fy
Type: System.Double
 Information about the other bar in bar group Fy
BarSizeOthers_Notation
Type: System.String
 Information about the other bar in bar group notation
Number
Type: System.Int32
 Total number of bars in the group, including First and Last
StartX
Type: System.Double
 Start distance of bar zone, with respect to first point of Design Leg centerline
StartY
Type: System.Double
 Offset Y from the Design Leg centerline at first bar
EndX
Type: System.Double
 End distance of bar zone, with respect to first point of Design Leg centerline
EndY
Type: System.Double
 Offset Y from the Design Leg centerline at last bar
StartBarBend
Type: System.Int32
 The bar bend that applies at the start of the bars, at lower end. None, Cut, Curtail, Bend45, Bend90, Bend135, Bend180, Joggle
EndBarBend
Type: System.Int32
 The bar bend that applies at the end of the bars, at upper end.
OffsetZ
Type: System.Double
 Vertical starting offset from Design Leg Z level
BarLength
Type: System.Double
 the length of these bars, along height of the pier, above Offset Z
LocationCode
Type: System.Int32
 : 0 - vertical distributed, 1 - vertical confinement zone I, 2 - vertical confinement zone J,
Return Value
Type: Int32
Returns zero if the function is successful; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace